[
    {
        "text":"Аккуратный программист — быстрый программист",
        "author":"Билл Гейтс"
    },
    {
        "text":"Сегодня ты делаешь код, завтра код делает тебе деньги",
        "author":"Стив Джобс"
    },
    {
        "text":"Если твой код работает, значит это хороший код",
        "author":"Маркус Перссон"
    },
    {
        "text":"Чтобы понять код мида, нужно быть мидом. Чтобы понять код сеньора, достаточно быть джуном",
        "author":"Гейб Логан Ньюэлл"
    },
    {
        "text":"У каждого языка есть время жизни. За исключением ’Кобола’, конечно",
        "author":"Брайан Керниган"
    },
    {
        "text":"Настоящий программист гораздо больше читает, чем пишет",
        "author":"Линус Торвальдс"
    },
    {
        "text":"Скорость имеет значение",
        "author":"Павел Дуров"
    },
    {
        "text":"Когда я не знаю, с чего начать, я открываю чистый файл и пишу: ’// С чего бы начать?’. Дальше всё идёт как-то само собой",
        "author":"Расмус Лердорф"
    },
    {
        "text":"Если ваша работа не документирована, значит вы не работали",
        "author":"Ада Лавлейс"
    },
    {
        "text":"Писать книги сложнее, чем писать программы. Любой писатель может стать хотя бы посредственным программистом. Обратное, к сожалению, неверно",
        "author":"Дональд Эрвин Кнут"
    },
    {
        "text":"Если над кодом работали 20 человек, значит его можно сделать в 20 раз меньше и в 20 раз быстрее",
        "author":"Бьёрн Страуструп"
    },
    {
        "text":"Если бы Омар Хайям жил сейчас, он наверняка был бы пиратом",
        "author":"Ричард Мэттью Столлман"
    },
    {
        "text":"На собеседованиях я обычно спрашиваю, часто ли испытуемый использует костыли. Это хороший способ отсеять патологических лжецов",
        "author":"Стив Возняк"
    },
    {
        "text":"Не ожидайте ухоженных ногтей от первопроходцев",
        "author":"Сид Мейер"
    },
    {
        "text":"Можно сделать довольно большой проект, вообще не прикасаясь к мыши. Но зачем?",
        "author":"Алан Кёртис Кэй"
    },
    {
        "text":"На длинных дистанциях выигрывают стайеры",
        "author":"Брэм Коэн"
    },
    {
        "text":"Всегда начинайте со структуры данных",
        "author":"Джон Кармак"
    },
    {
        "text":"Кофе не помогает программировать, зато он приятен на вкус",
        "author":"Джеймс Гослинг"
    },
    {
        "text":"Не бывает хороших языков, бывают хорошие программисты",
        "author":"Андерс Хейлсберг"
    },
    {
        "text":"Проще отучить собаку лаять на почтальона, чем отучить админа работать под рутом",
        "author":"Кен Томпсон"
    },
    {
        "text":"Когда-то я был достаточно наивен, надеясь, что мне достаточно будет хорошо выучить один язык",
        "author":"Давид Хейнемейер Ханссон"
    },
    {
        "text":"Завидую тестировщикам: все хотят с ними дружить",
        "author":"Эндрю Таненбаум"
    },
    {
        "text":"Отдавайте распоряжения в письменном виде: программист вы, в конце концов, или нет?",
        "author":"Юкихиро Мацумото"
    },
    {
        "text":"И где теперь ваш ассемблер?",
        "author":"Ларри Уолл"
    },
    {
        "text":"Чем опытнее программист, тем лучше он осознаёт всю скудность своих знаний и навыков",
        "author":"Крис Хьюз"
    },
    {
        "text":"Хакер всегда выигрывает в честной схватке, потому что он нечестен",
        "author":"Эрик Стивен Рэймонд"
    },
    {
        "text":"Идеальному коду место в музее: там ценят всякие древности",
        "author":"Питер Нортон"
    },
    {
        "text":"Не экономьте на дизайне: конечный пользователь ровным счётом ничего не понимает в программировании",
        "author":"Дастин Московиц"
    },
    {
        "text":"Довольно сложно руководить программистом, которому не нужны деньги",
        "author":"Стив Возняк"
    },
    {
        "text":"Выучите LISP, и вы не будете работать ни одного дня в своей жизни. Выучите PHP, и вы таки сумеете заработать себе на кусок хлеба",
        "author":"Ричард Мэттью Столлман"
    },
    {
        "text":"Прежде, чем начать сеанс парного программирования, уберите из комнаты все острые предметы",
        "author":"Брендан Эйх"
    }
]