[
    {
        "text": "Neat programmer - fast programmer",
        "author": "Bill Gates"
    },
    {
        "text": "Today you make the code, tomorrow the code makes you money",
        "author": "Steve Jobs"
    },
    {
        "text": "If your code works, then this is good code",
        "author": "Markus Persson"
    },
    {
        "text": "To understand the mid lane code, you need to be mid. To understand the senior lane code, you just need to be a junior",
        "author": "Gabe Logan Newell"
    },
    {
        "text": "Every language has a lifetime. Except for Kobol, of course.",
        "author": "Brian Kernighan"
    },
    {
        "text": "A real programmer reads much more than he writes",
        "author": "Linus Torvalds"
    },
    {
        "text": "Speed ​​matters",
        "author": "Pavel Durov"
    },
    {
        "text": "When I don't know where to start, I open a blank file and write:",
        "author": "Rasmus Lerdorf"
    },
    {
        "text": "If your work is not documented, then you have not worked",
        "author": "Ada Lovelace"
    },
    {
        "text": "Writing books is harder than writing programs. Any writer can become at least a mediocre programmer. The converse is unfortunately not true.",
        "author": "Donald Erwin Knuth"
    },
    {
        "text": "If 20 people worked on the code, then it can be done 20 times less and 20 times faster",
        "author": "Bjorn Stroustrup"
    },
    {
        "text": "If Omar Khayyam lived now, he would surely be a pirate",
        "author": "Richard Matthew Stallman"
    },
    {
        "text": "In interviews, I usually ask if the subject uses crutches a lot. This is a good way to weed out pathological liars.",
        "author": "Steve Wozniak"
    },
    {
        "text": "Don't expect well-groomed nails from pioneers",
        "author": "Sid Meyer"
    },
    {
        "text": "You can make a fairly large project without touching the mouse at all. But why?",
        "author": "Alan Curtis Kay"
    },
    {
        "text": "Long distance runners win",
        "author": "Bram Cohen"
    },
    {
        "text": "Always start with a data structure",
        "author": "John Carmack"
    },
    {
        "text": "Coffee doesn't help programming, but it tastes good",
        "author": "James Gosling"
    },
    {
        "text": "There are no good languages, there are good programmers",
        "author": "Anders Hejlsberg"
    },
    {
        "text": "It's easier to wean a dog from barking at a postman than to wean an admin to work under the root",
        "author": "Ken Thompson"
    },
    {
        "text": "I was once naive enough, hoping that I would be good enough to learn one language",
        "author": "David Heinemeyer Hansson"
    },
    {
        "text": "I envy the testers: everyone wants to be friends with them",
        "author": "Andrew Tanenbaum"
    },
    {
        "text": "Give orders in writing: Are you a programmer, after all, or not?",
        "author": "Yukihiro Matsumoto"
    },
    {
        "text": "And where is your assembler now?",
        "author": "Larry Wall"
    },
    {
        "text": "The more experienced the programmer, the better he realizes the scarcity of his knowledge and skills",
        "author": "Chris Hughes"
    },
    {
        "text": "A hacker always wins a fair fight because he is dishonest",
        "author": "Eric Stephen Raymond"
    },
    {
        "text": "A place for an ideal code is in a museum: all sorts of antiquities are appreciated there",
        "author": "Peter Norton"
    },
    {
        "text": "Don't skimp on design: the end user doesn't understand programming at all",
        "author": "Dustin Moskowitz"
    },
    {
        "text": "It's quite difficult to manage a programmer who doesn't need money",
        "author": "Steve Wozniak"
    },
    {
        "text": "Learn LISP, and you won't work a single day in your life. Learn PHP, and you will still be able to earn your living",
        "author": "Richard Matthew Stallman"
    },
    {
        "text": "Before starting a pair programming session, remove all sharp objects from the room",
        "author": "Brendan Eich"
    }
]